org.org
#+STARTUP: overview
#+FILETAGS: :emacs:




#+title:Org Mode
#+PROPERTY: header-args:emacs-lisp :results none :tangle ./org.el :mkdirp yes

#+begin_src emacs-lisp

;; Org Mode
(straight-use-package 'org)
(require 'org)

#+end_src

* Setup
** Startup

#+begin_src emacs-lisp

;; Startup with inline images
(setq org-startup-with-inline-images t)

#+end_src

** General purpose functions
*** Queries
**** in
***** org-in-src-block-p

#+begin_src emacs-lisp

;; `org-in-src-block-p' gives false positives as of Org Mode 9.5.3. For
;; this reason, determine if cursor in src block with the more reliable
;; `org-babel-where-is-src-block-head'
(advice-add 'org-in-src-block-p :override 'org-babel-where-is-src-block-head)

#+end_src

**** at
***** org-at-ellipsis-l

#+begin_src emacs-lisp

(defun custom/org-at-ellipsis-l (&optional position)
  (and (custom/org-relative-line-list-folded) (custom/at-point 'end-of-visual-line)))

#+end_src 

***** org-at-ellipsis-h

#+begin_src emacs-lisp

(defun custom/org-at-ellipsis-h (&optional position) 
  (and (custom/org-relative-line-heading-folded) (custom/at-point 'end-of-visual-line)))

#+END_src 

***** org-at-keyword

#+begin_src emacs-lisp

(defun custom/org-at-keyword (&optional number)
  (custom/relative-line-regex "^#+.*$" number))

#+END_src 
***** org-at-heading

#+begin_src emacs-lisp

(defun custom/org-at-heading (&optional point)
  (let ((point (or point (point))))
    (save-excursion (goto-char point) (custom/org-relative-line-heading))))

#+end_src

***** TODO org-at-bol-list

- &option point

#+begin_src emacs-lisp

(defun custom/org-at-bol-list () 
  (and (custom/org-relative-line-list) (custom/at-point 'beginning-of-line-text)))

#+END_src 

***** TODO org-at-bol-heading

- &option point

#+begin_src emacs-lisp

(defun custom/org-at-bol-heading () 
  (and (custom/org-relative-line-heading) (custom/at-point 'custom/org-goto-heading-bol)))

#+END_src 

***** TODO org-at-eol-heading

- &option point

#+begin_src emacs-lisp

(defun custom/org-at-eol-heading ()
  (and (custom/org-relative-line-heading) (eolp) (not (custom/org-at-ellipsis-h)) (not (custom/org-relative-line-heading-empty))))

#+end_src

***** TODO org-at-list-paragraph

- &option point

#+begin_src emacs-lisp

(defun custom/org-at-list-paragraph ()
  (and (not (custom/org-relative-line-heading))
       (not (custom/org-relative-line-list))
       (not (org-in-src-block-p))
       (custom/org-relative-line-list -1)))

#+end_src

**** after
***** org-after-list-or-indent

#+begin_src emacs-lisp

(defun custom/org-after-list-or-indent ()
  (or (custom/org-relative-line-list -1) (custom/relative-line-indented -1)))

#+end_src

**** line
***** org-relative-line-list

#+begin_src emacs-lisp

(defun custom/org-relative-line-list (&optional number)
  (interactive)
  (custom/relative-line (lambda () (progn (beginning-of-line-text) (org-at-item-p)))  number))

#+end_src

***** org-relative-line-list-empty

#+begin_src emacs-lisp

(defun custom/org-relative-line-list-empty (&optional number)
  (and (custom/org-relative-line-list)
       (custom/relative-line-regex "[[:blank:]]*[-+*]?[0-9.)]*[[:blank:]]+$" number)))

#+end_src

***** org-relative-line-list-folded

#+begin_src emacs-lisp

(defun custom/org-relative-line-list-folded (&optional number)
  "Returns non-nil if `point-at-eol' of current visual line
is on a folded list item."
  (interactive)
  (custom/relative-line (lambda () (and (org-at-item-p) (invisible-p (point-at-eol)))) number))

#+end_src

***** org-relative-line-heading

#+begin_src emacs-lisp

(defun custom/org-relative-line-heading (&optional number)
  (interactive)
  (custom/relative-line 'org-at-heading-p number))

#+end_src

***** org-relative-line-heading-empty

#+begin_src emacs-lisp

(defun custom/org-relative-line-heading-empty (&optional number)
  (custom/relative-line (lambda () (beginning-of-line-text) (org-point-at-end-of-empty-headline)) number))

#+end_src

***** org-relative-line-heading-folded

#+begin_src emacs-lisp

(defun custom/org-relative-line-heading-folded (&optional number)
  "Returns non-nil if `point-at-eol' of current visual line
is on a folded heading."
  (interactive)
  (custom/relative-line (lambda () (and (org-at-heading-p) (invisible-p (point-at-eol)))) number))

#+end_src

***** org-relative-line-heading-or-list

#+begin_src emacs-lisp

(defun custom/org-relative-line-heading-or-list (&optional number)
  (custom/relative-line 'org-at-heading-or-item-p number))

#+end_src
**** subtree
***** org-subtree-blank

#+begin_src emacs-lisp

(defun custom/org-subtree-blank ()
  "Return t if the current subtree consists of
a `custom/region-blank'."
  (interactive)
  (apply #'custom/region-blank (custom/org-subtree-region)))

#+end_src

***** org-subtree-empty

#+begin_src emacs-lisp

(defun custom/org-subtree-empty ()
  (interactive)
  (string-equal "" (custom/org-subtree-content)))

#+end_src

***** org-headings-follow

#+begin_src emacs-lisp

(defun custom/org-headings-follow ()
  (let ((pos (custom/get-point 'beginning-of-visual-line)))
    (save-excursion (custom/org-goto-heading-next)
		           (and (not (= pos (point))) (custom/org-relative-line-heading)))))

#+end_src

***** org-headings-precede

#+begin_src emacs-lisp

(defun custom/org-headings-precede ()
  (let ((pos (custom/get-point 'beginning-of-visual-line)))
    (save-excursion (custom/org-goto-heading-previous)
		          (and (not (= pos (point))) (custom/org-relative-line-heading)))))

#+end_src

***** org-subtree-blank-up-to-point

#+begin_src emacs-lisp

(defun custom/org-subtree-blank-up-to-point ()
  (interactive)
  (let ((heading-eol (save-excursion (custom/org-goto-heading-current) (end-of-line) (point))))
    (custom/region-blank heading-eol (point))))

#+end_src

**** heading
***** org-heading-first-child

#+begin_src emacs-lisp

(defun custom/org-heading-first-child ()
  (save-excursion
    (custom/org-goto-heading-current)
    (let ((pos (custom/get-point 'beginning-of-visual-line)))
      (org-backward-heading-same-level 1)
      (= pos (custom/get-point 'beginning-of-visual-line)))))

#+end_src

***** org-heading-has-children

#+begin_src emacs-lisp

(defun custom/org-heading-has-children ()
  (interactive)
  (save-excursion (org-goto-first-child)))

#+end_src

*** Retrieval
**** org-subtree-region

#+begin_src emacs-lisp

(defun custom/org-subtree-region (&optional element)
  "Retrieve the beginning and end of the current subtree."
  (if (org-element--cache-active-p)
      (let* ((heading (org-element-lineage
                       (or element (org-element-at-point))
                       '(headline) t))
	     (head (org-element-property :begin heading))
	     (next (org-element-property :end   heading)))
	  (if (and heading next)
	      (progn (save-excursion (goto-char head)
				     (beginning-of-line 2)
				     (setq beg (point)))
		     (save-excursion (goto-char next)
				     (beginning-of-line)
				     (setq end (max beg (point))))
		     (list beg end))))))

#+end_src

**** org-subtree-content

#+begin_src emacs-lisp

(defun custom/org-subtree-content ()
  "Retrieve the content of the current subtree."
  (setq content (apply #'buffer-substring-no-properties (custom/org-subtree-region))))

#+end_src

**** org-get-title-file

#+begin_src emacs-lisp

(defun custom/org-get-title-file (file)
  (with-current-buffer (find-file-noselect file)
       (custom/org-get-title-current-buffer)))

#+end_src

**** org-get-title-current-buffer

#+begin_src emacs-lisp

(defun custom/org-get-title-current-buffer ()
    (nth 1
     (assoc "TITLE"
      (org-element-map (org-element-parse-buffer 'greater-element)
          '(keyword)
        #'custom/get-keyword-key-value))))

#+end_src

*** TODO Outline editing

- deprecated cl warning
   - find dependency

**** Set
***** set-outline-overlay-data

#+begin_src emacs-lisp

(defun custom/org-set-outline-overlay-data (data)
  "Create visibility overlays for all positions in DATA.
DATA should have been made by `org-outline-overlay-data'."
  (org-with-wide-buffer
   (org-show-all)
   (dolist (c data) (org-flag-region (car c) (cdr c) t 'outline))))

(defvar-local custom/org-outline-state nil
  "Place for saving org outline state before reverting the buffer.")

(put 'custom/org-outline-state 'permanent-local t)

#+end_src

***** restore-outline-state

#+begin_src emacs-lisp

(defun custom/org-restore-outline-state ()
  "Save org outline state in `custom/org-outline-state'.
It can be recovered afterwards with `custom/org-recover-outline-state'."
  (when custom/org-outline-state
    (custom/org-set-outline-overlay-data custom/org-outline-state)
    (setq custom/org-outline-state nil)))

#+end_src

**** Get
